In [4]:
# Easy

In [5]:
# Скачать данные отсюда (кнопка download all снизу):

# https://www.kaggle.com/c/titanic/data

# Это данные о пассажирах Титаника и информация о том, кто выжил, а кто нет. Будем анализировать файл train.csv.

# Необходимо прочитать файл, посчитать процент детей (младше 18 лет), соотношение мужчин/женщин на борту

In [22]:
import pandas as pd
df = pd.read_csv('C:/Users/Alexandr/Desktop/Data Science/Brunoiam/Untitled Folder/train.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [29]:
children = print(round(df[df['Age'] < 18].shape[0]/df.shape[0]*100, 2) , '%')
children

12.68 %

In [28]:
man_woman = print('Мужчин', round(df[df['Sex'] == 'male'].shape[0]/df.shape[0]*100, 2) , '%')
man_woman

Мужчин 64.76 %

In [30]:
# Normal
# Посчитать по скольким людям нет информации (пола или возраста)

# Вывести гистограмму по возрасту пассажиров

# Посчитать какой процент мужин и женщин выжили, какой процент детей выжили.

# Посчитать корреляцию между возрастом и выживаемостью, полом и выживаемостью